{
  "filename": "bad.pdf",
  "passed": false,
  "issues": [
    {
      "criterion": "WCAG 2.4.2 Page Titled (Level A)",
      "description": "PDF document does not have a title in its metadata",
      "impact": "Screen readers cannot announce the document title, making it difficult for users to understand the document's purpose or distinguish between multiple open documents",
      "remediation": "Add a descriptive title to the PDF document's metadata properties"
    },
    {
      "criterion": "WCAG 3.1.2 Language of Parts (Level AA)",
      "description": "PDF document contains text in a language different from the document's default language (en-ca) without proper language tagging. Examples: \"Notre site Web utilise des tém...\" (page 1, detected as fr); \"sauvegardant vos paramètres pe...\" (page 1, detected as en); \"http://microsoft.com\" (page 1, detected as en)",
      "impact": "Screen readers will pronounce this text incorrectly, making it difficult or impossible for users to understand content in different languages",
      "remediation": "Tag text in different languages with the appropriate language identifier in the PDF structure"
    },
    {
      "criterion": "WCAG 2.4.4 Link Purpose (In Context) (Level A)",
      "description": "PDF document contains hyperlinks that lack meaningful descriptive text. Examples: \"http://microsoft.com\" (page 1)",
      "impact": "Screen readers announce link text to blind users. When links display raw URLs or generic text like 'click here', blind users cannot determine the link's purpose or destination without exploring it, making navigation inefficient and potentially confusing.",
      "remediation": "Associate each hyperlink with descriptive text that clearly indicates its purpose or destination. Avoid using raw URLs, page numbers, or generic phrases like 'click here' as link text."
    }
  ],
  "pendingTests": [
    {
      "criterion": "WCAG 2.4.5 Multiple Ways (Level AA)",
      "reason": "We are aware of this criterion and are actively working on it. We need to gather requirements from sight-impaired users about what constitutes acceptable navigation in both forms and documents before implementing this test.",
      "status": "In Progress - Requirements Gathering"
    },
    {
      "criterion": "WCAG 1.3.2 Meaningful Sequence (Level A)",
      "reason": "We are actively working on implementing this test. This criterion ensures that screen readers present content in a meaningful order that preserves relationships and logical reading sequence. We need to develop robust algorithms to analyze the reading order in PDF documents.",
      "status": "In Progress - Algorithm Development"
    },
    {
      "criterion": "WCAG 2.4.3 Focus Order (Level A)",
      "reason": "We are planning to implement this test. This criterion ensures that the order of focus when navigating through interactive elements in a PDF (like form fields and links) follows a sequence that preserves meaning and operability. This is essential for blind users who navigate documents using keyboard commands with screen readers.",
      "status": "Planned - Requirements Analysis"
    }
  ],
  "additionalNotes": "Note: We are actively working on implementing tests for WCAG 2.4.5 Multiple Ways, WCAG 1.3.2 Meaningful Sequence, and WCAG 2.4.3 Focus Order. For Multiple Ways, we need to gather requirements from sight-impaired users to determine acceptable navigation methods. For Meaningful Sequence, we're developing algorithms to verify that the reading order in PDF documents is logical. For Focus Order, we're analyzing how to test that interactive elements follow a sequence that preserves meaning and operability for screen reader users.",
  "timestamp": "2025-03-17T20:10:03.482Z"
}